Revit 2027 API
StructuralSectionRectangular.Height Property
 Section height, depth.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double Height { get; set; }
Public Property Height As Double
	Get
	Set
public:
property double Height {
	double get ();
	void set (double value);
}
member Height : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionRectangular Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace